//=============================================================================
//
// 背景のクラス [bg.h]
// Author : 川村優斗
//
//=============================================================================
//プリプロセッサ
#ifndef _BG_H_
#define _BG_H_

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include"manager.h"
#include"texture.h"

//***********************z******************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 背景のクラスの定義
//*****************************************************************************
class CBg : public CScene2D
{
public:
	CBg(int nPriority = 2);
	~CBg();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	// 背景の生成
	static CBg	*Create(D3DXVECTOR3 pos, D3DXVECTOR2 size, CTexture::TEXTURE_TYPE ntype);

private:
	D3DXVECTOR3					m_pos;					// 位置
	D3DXCOLOR					m_col;					// 色
	CTexture::TEXTURE_TYPE		m_type;					// 種類
	int							m_nPriority;			// 優先順位
	int							m_time;					// 残り時間
	int							m_nHelpNum;				// ヘルプのページ数

	bool m_bTextureFlag;

};

#endif // !_BG_H_