//=============================================================================
//
// ランキング表示のクラス [ranking.h]
// Author : 川村優斗
//
//=============================================================================
#ifndef _RANKING_H_
#define _RANKING_H_

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include"scene.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_RANKING (6)	//ランキングの数

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CScore;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CRanking : public CScene
{
public:
	CRanking(int nPriority = 5);
	~CRanking();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CRanking *Create(D3DXVECTOR3 pos, D3DXVECTOR2 size, bool bFlag);

private:
	int	m_nScore[MAX_RANKING];				// 格納するスコア
	D3DXVECTOR2 m_size;						// サイズ
	D3DXVECTOR3 m_pos;						// 位置
	static CScore	*m_pScore[MAX_RANKING];	// スコア情報
	CScore *m_pNowScore;					// 現在のスコア
	bool m_bFlag;							// メニューから開いた場合とゲーム終了時の判定
};


#endif //!_RANKING_H_