//=============================================================================
//
// タイトル画面の処理 [title.cpp]
// Author : 川村優斗
//
//=============================================================================

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "title.h"
#include"manager.h"
#include"sound.h"
#include"fade.h"
#include"bg.h"
#include"ui.h"
#include"texture.h"

//*****************************************************************************
// 静的メンバ変数
//*****************************************************************************

//=============================================================================
// コンストラクタ
//=============================================================================
CTitle::CTitle()
{
	m_fade = false;
}

//=============================================================================
// デストラクタ
//=============================================================================
CTitle::~CTitle()
{
}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CTitle::Init(void)
{
	CBg::Create(D3DXVECTOR3(0.0f + SCREEN_CENTER_X, 0.0f + SCREEN_CENTER_Y, 0.0f), D3DXVECTOR2(SCREEN_WIDTH / 2, SCREEN_HEIGHT / 2), CBg::BGTYPE_OTHER, CTexture::TEXTURETYPE_BGTITLE);

	// サウンド取得
	CSound *pSound = CManager::GetSound();
	pSound->Play(pSound->SOUND_LABEL_BGM_TITLE);
	pSound->SetVolume(pSound->SOUND_LABEL_BGM_TITLE, 0.2f);

	// UIの読み込み
	CUI::Create(D3DXVECTOR3(0.0f + SCREEN_CENTER_X, 200.0f + SCREEN_CENTER_Y, 0.0f), D3DXVECTOR2(450.0f, 80.0f), CTexture::TEXTURETYPE_PUSH);
	CUI::Create(D3DXVECTOR3(0.0f + SCREEN_CENTER_X, 100.0f, 0.0f), D3DXVECTOR2(400.0f, 150.0f), CTexture::TEXTURETYPE_NAME);
	CUI::Create(D3DXVECTOR3(0.0f, 100.0f, 0.0f), D3DXVECTOR2(60.0f, 50.0f), CTexture::TEXTURETYPE_PLAYER);

	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CTitle::Uninit(void)
{
	// サウンド取得
	CSound *pSound = CManager::GetSound();
	pSound->Stop(pSound->SOUND_LABEL_BGM_TITLE);

	Release();
}

//=============================================================================
// 更新処理
//=============================================================================
void CTitle::Update(void)
{
}

//=============================================================================
// 描画処理
//=============================================================================
void CTitle::Draw(void)
{
}

//=============================================================================
// メニュー画面の生成
//=============================================================================
CTitle * CTitle::Create(void)
{
	// タイトルのインスタンス生成
	CTitle *pTitle = new CTitle;

	// タイトルの準備
	if (pTitle != NULL)
	{
		pTitle->Init();
	}
	return pTitle;
}