//=============================================================================
//
// 爆発の処理 [explosion.cpp]
// Author : 川村優斗
//
//=============================================================================

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include"explosion.h"
#include"sound.h"
#include"time.h"
#include"game.h"

//*****************************************************************************
// 静的メンバ変数
//*****************************************************************************


//=============================================================================
// コンストラクタ
//=============================================================================
CExplosion::CExplosion(int nPriority) : CScene2D(nPriority)
{
	m_nCounterAnim = 0;
	m_nPatternAnim = 0;
}

//=============================================================================
// デストラクタ
//=============================================================================
CExplosion::~CExplosion()
{
}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CExplosion::Init(void)
{
	CScene2D::Init();

	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CExplosion::Uninit(void)
{
	CScene2D::Uninit();
}

//=============================================================================
// 更新処理
//=============================================================================
void CExplosion::Update(void)
{
	// アニメーションカウンタの加算
	m_nCounterAnim++;

	if (m_nCounterAnim % 4 == 0)
	{
		m_nCounterAnim = 0;

		// 現在の時間を取得
		CTime *pTime = CGame::GetTime();
		int nTime = pTime->GetTime();

		if (nTime != 0)
		{
			m_nPatternAnim++;
		}

		CScene2D::SetVtxTex(m_nPatternAnim, 0.125f, 0.125f, 1.0f);

		CScene2D::Update();

		// 爆発が終わると消える
		if (m_nPatternAnim == 8)
		{
			Uninit();
			return;
		}
	}
}

//=============================================================================
// 描画処理
//=============================================================================
void CExplosion::Draw(void)
{
	CScene2D::Draw();
}

//=============================================================================
// 生成処理
//=============================================================================
CExplosion * CExplosion::Create(D3DXVECTOR3 pos, D3DXVECTOR2 size, CTexture::TEXTURE_TYPE ntype)
{
	// 爆発のインスタンス生成
	CExplosion *pExplosion = new CExplosion;

	// サウンド取得
	CSound *pSound = CManager::GetSound();

	// 爆発音再生
	pSound->Play(pSound->SOUND_LABEL_EXPLOSION);
	pSound->SetVolume(pSound->SOUND_LABEL_EXPLOSION, 0.5f);

	// 爆発の準備
	if (pExplosion != NULL)
	{
		pExplosion->Init();
		pExplosion->SetPosition(pos);
		pExplosion->SetSize(size);
		pExplosion->BindTexture(CManager::GetTexture()->SetTextureType(ntype));
	}
	return pExplosion;
}