//=============================================================================
//
// リザルト画面のクラス処理 [result.h]
// Author : 川村優斗
//
//=============================================================================
#ifndef _RESULT_H_
#define _RESULT_H_

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include"scene.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CScene2D;
class CRanking;

//*****************************************************************************
// クラスの定義
//*****************************************************************************
class CResult : public CScene
{
public:
	CResult();
	~CResult();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CResult *Create(void);

	static CRanking *GetRanking(void);

private:
	bool			m_fade;		// フェード判定
	static CRanking	*m_pRanking;// ランキングデータ

};
#endif // !_RESULT_H_
