//=============================================================================
//
// スコアのクラス [score.h]
// Author : 川村優斗
//
//=============================================================================
#ifndef _SCORE_H_
#define _SCORE_H_

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include"scene.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_SCORE (5)

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CNumber;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CScore : public CScene
{
public:
	CScore(int nPriority = 4);
	~CScore();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	void SetScore(int nScore);
	void AddScore(int nValue);
	int GetScore(void);


	static CScore *Create(D3DXVECTOR3 pos, D3DXVECTOR2 size);

private:
	CNumber		*m_apNumber[MAX_SCORE];	// ナンバーのインスタンス

	D3DXVECTOR3 m_pos;					// 位置
	D3DXVECTOR2 m_size;					// サイズ

	int	m_nScore;						// スコア
};



#endif // !_SCORE_H_
