//=============================================================================
//
// 時間経過のクラス [time.h]
// Author : 川村優斗
//
//=============================================================================
#ifndef _TIME_H_
#define _TIME_H_

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include"scene.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_TIME (3)	// 時間のケタ数

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CNumber;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CTime : public CScene
{
public:
	CTime(int nPriority = 4);
	~CTime();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	void AddTime(int nValue);	//時間の加算
	int GetTime(void);			//時間の取得

	// 時間の生成
	static CTime *Create(D3DXVECTOR3 pos, D3DXVECTOR2 size, int time);

private:
	CNumber		*m_apNumber[MAX_TIME];	// ナンバーのインスタンス

	DWORD		m_dwCurrentTime;		// 経過時間
	DWORD		m_dwExecLastTime;		// 経過時間

	D3DXVECTOR2 m_size;					// 大きさ
	D3DXVECTOR3 m_pos;					// 位置
	D3DXCOLOR	m_col;					// 色

	bool		m_fade;					// フェード判定
	bool		m_bflag;				// タイムアップ判定

	int			m_nTime;				// 時間
	int			m_nInterval;			// UIを出すまでの間隔
};

#endif // !_TIME_H_
